In [1]:
import pandas as pd 
import numpy as np

In [2]:
df1 = pd.read_csv("cust_dimen.csv")
df1.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [3]:
df2 = pd.read_csv("market_fact.csv")
df2.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.27,0.01,13,4.56,0.93,0.54
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.89,0.09,43,729.34,14.30,0.37
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.15,0.08,35,1219.87,26.30,0.38

In [15]:
df2[df2["Cust_id"] == "Cust_1"]

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
5858,Ord_1,Prod_1,SHP_1,Cust_1,261.54,0.04,6,-213.25,35.0,0.8

In [10]:
df3 = pd.read_csv("orders_dimen.csv")
df3.head()

   Order_Date Order_Priority Ord_id
0  13-10-2010            LOW  Ord_1
1  01-10-2012           HIGH  Ord_2
2  10-07-2011           HIGH  Ord_3
3  28-08-2010  NOT SPECIFIED  Ord_4
4  17-06-2011           HIGH  Ord_5

In [16]:
df3[df3.Ord_id == "Ord_293"]

     Order_Date Order_Priority   Ord_id
292  09-12-2009  NOT SPECIFIED  Ord_293

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5506 entries, 0 to 5505
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_Date      5506 non-null   object
 1   Order_Priority  5506 non-null   object
 2   Ord_id          5506 non-null   object
dtypes: object(3)
memory usage: 129.2+ KB

In [5]:
df4 = pd.read_csv("shipping_dimen.csv")
df4.head()

   Order_ID       Ship_Mode   Ship_Date Ship_id
0         3     REGULAR AIR  20-10-2010   SHP_1
1       293  DELIVERY TRUCK  02-10-2012   SHP_2
2       293     REGULAR AIR  03-10-2012   SHP_3
3       483     REGULAR AIR  12-07-2011   SHP_4
4       515     REGULAR AIR  30-08-2010   SHP_5

In [18]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7701 entries, 0 to 7700
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Order_ID   7701 non-null   int64
 1   Ship_Mode  7701 non-null   object
 2   Ship_Date  7701 non-null   object
 3   Ship_id    7701 non-null   object
dtypes: int64(1), object(3)
memory usage: 240.8+ KB

In [6]:
df5 = pd.read_csv("prod_dimen.csv")
df5.head()

  Product_Category            Product_Sub_Category Prod_id
0  OFFICE SUPPLIES          STORAGE & ORGANIZATION  Prod_1
1  OFFICE SUPPLIES                      APPLIANCES  Prod_2
2  OFFICE SUPPLIES  BINDERS AND BINDER ACCESSORIES  Prod_3
3       TECHNOLOGY    TELEPHONES AND COMMUNICATION  Prod_4
4        FURNITURE              OFFICE FURNISHINGS  Prod_5